{
    "version": "0.01",
    "instructions": {
        "qa-01": "Answer the following question through step-by-step reasoning.",
        "qa-02": "Answer the following question through careful, concise step-by-step reasoning.",
        "qa-03": "Answer the following question through careful, concise step-by-step reasoning. Avoid making up wrong statements. If the question does not make sense or cannot be answered, write \"I cannot answer the question\". If you do not have a good answer, write \"I do not have a good answer\". If you are uncertain, write \"I am uncertain about this\".",
        "qa-04": "Answer the following question through careful, concise step-by-step reasoning. Avoid making up wrong statements. Generate sub-questions that are required to answer the original question, answer them until you can answer the original question. If the question does not make sense or cannot be answered, write \"I cannot answer the question\". If you do not have a good answer, write \"I do not have a good answer\". If you are uncertain, write \"I am uncertain about this\".",
        "qa-05": "Instruction: Read the question and decide if it is easy or difficult. If it is easy, give the answer directly without reasoning. If it is difficult, answer it through step-by-step reasoning.",
        "qa-06": "Instruction: Determine how much step-by-step thinking is required to correctly answer the question.",
        "qa-07": "Instruction: Determine how much step-by-step thinking is required to correctly answer the question. Suppose that exactly one of the answer choices must be the right one.",
        "qa-08": "Let's use the following clues to answer the following multiple-choice question, using the following procedure:\n(1) First, let's work out every answer option in a step by step way and consider if it is the correct option.\n(2) Second, let's combine all the information gathered to be sure we have the right answer.\n(3) Third, map the answer to one of the multiple choice answers. If you think none of the answers is correct, state that, but nevertheless select the one of the multiple choice answers that fits best.",
        "qa-09": "Let's use the following strategy to be sure we have the right answer:\n(1) First, let's write down a step-by-step procedure of how to come to the right answer.\n(2) Second, let's go through each of those steps.",
        "qa-10": "First think step by step - describe your plan for how to get to the right answer, written out in great detail. Then answer the question.",
        "qa-11": "Instruction: First think step by step - describe your plan for how to get to answer the question, written out in great detail. Work your plan out in a step by step way to be sure you have the right answer.",
        "qa-12": "Carefully read the question & work this out in a step by step way to be sure you have the right answer. Be certain to spell out your thoughts & reasoning so anyone can verify them. Spell out everything in painstaking detail & don't skip any steps!",
        "qa-13": "Instruction: First let's rephrase the question to be sure we understood it correctly. Second, let's work this out step by step by spelling out our thoughts & reasoning so anyone can verify them. Third, make sure we have the right answer.",
        "qa-14": "Instruction: First, make a list of facts, which are relevant to the question. Second, elaborate multiple times on this list of facts, to be sure you wrote down everything that could be important. Third, work it out in a step by step way to be sure you have the right answer.",
        "qa-15": "Answer the following question through careful, concise step-by-step reasoning. First, write down the most important facts you know related to the question. Second, generate sub-questions that are required to answer the original question, answer them until you can answer the original question.",
        "qa-16": "Answer the following question through careful, concise step-by-step reasoning. First, complement the question with helpful knowledge and important additional facts. Second, generate sub-questions that are required to answer the original question, answer them until you can answer the original question.",
        "qa-17": "Create a dialog between a professor and a student. The student asks sub-questions to the question. The professor works them out in a step by step way and makes sure that the student understood how they got to the right answer.",
        "qa-18": "Instruction: Who would be the perfect person to answer that question correctly? What kind of expertise and additional knowledge does this person have about the question? Write down how that person work this out in a step by step way to be sure we have the right answer.",
        "qa-19": "Instruction: Let's answer the question using two different approaches independent from each other:\n(1) First, let's answer the question directly without reasoning.\n(2) Second, let's work this out in a step by step way to be sure we have the right answer.",
        "refl-01": "Answer the question, then critique the answer. Based on the critique, reconsider the other answer options and give a single final answer.",
        "zhou-01-ins": "Instruction: Let's work this out in a step by step way to be sure we have the right answer."
    },
    "cot_triggers": {
        "kojima-01": "Answer: Let's think step by step.",
        "kojima-02": "Answer: We should think about this step by step.",
        "kojima-03": "Answer: First,",
        "kojima-04": "Answer: Before we dive into the answer,",
        "kojima-05": "Answer: Proof followed by the answer.",
        "kojima-06": "Answer: Let's think step by step in a realistic way.",
        "kojima-07": "Answer: Let's think step by step using common sense and knowledge.",
        "kojima-08": "Answer: Let's think like a detective step by step.",
        "kojima-09": "Answer: Let's think about this logically.",
        "kojima-10": "Answer: Let's think step by step. First,",
        "kojima-11": "Answer: Let's think",
        "kojima-12": "Answer: Let's solve this problem by splitting it into steps.",
        "kojima-13": "Answer: The answer is after the proof.",
        "kojima-14": "Answer: Let's be realistic and think step by step.",
        "lievin-01": "Answer: Let's derive the differential diagnosis step by step.",
        "lievin-02": "Answer: Let's use step by step inductive reasoning, given the medical nature of the question.",
        "lievin-03": "Answer: Let's differentiate using step by step reasoning like a medical expert.",
        "lievin-04": "Answer: Let's think step by step using deductive reasoning.",
        "lievin-05": "Answer: Let's differentiate using step by step reasoning .",
        "lievin-06": "Answer: Let's think step by step to arrive at one of the options.",
        "lievin-07": "Answer: Let's break the problem into multiple steps.",
        "lievin-08": "Answer: Let's use step by step deductive reasoning, given the medical nature of the question.",
        "lievin-09": "Answer: Let's think step by step like a doctor.",
        "lievin-10": "Answer: Let's think step by step like a medical expert.",
        "lievin-11": "Answer: Let's summarize the facts step by step.",
        "lievin-12": "Answer: Let's think step by step using inductive reasoning.",
        "lievin-13": "Answer: Let's think step by step using deductive reasoning like a medical expert.",
        "lievin-14": "Answer: Let's be concise and think step by step.",
        "lievin-15": "Answer: Let's differentiate using step by step deductive reasoning like a medical expert.",
        "lievin-16": "Answer: Let's argue step by step.",
        "lievin-17": "Answer: Let's think step by step like a clinician.",
        "lievin-18": "Answer: Let's reflect on each answer option step by step.",
        "lievin-19": "Answer: Let's reason and differentiate options step by step like a medical expert.",
        "lievin-20": "Answer: Let's differentiate using step by step inductive reasoning like a medical expert.",
        "lievin-21": "Answer: Let's think step by step given every option equal consideration.",
        "lievin-22": "Answer: Let's think step by step like a scientist.",
        "lievin-23": "Answer: Let's use step by step inductive reasoning.",
        "lievin-24": "Answer: Let's work by elimination step by step.",
        "lievin-25": "Answer: Let's use step by step deductive reasoning.",
        "lievin-26": "Answer: Let's follow a Bayesian step by step approach.",
        "lievin-27": "Answer: Let's reflect on each option from the least likely to the most likely.",
        "lievin-28": "Answer: Let's use step by step Bayesian reasoning, given the medical nature of the question.",
        "zhou-01": "Answer: Let's work this out in a step by step way to be sure we have the right answer.",
        "ts-01": "Answer: Let's be logical.",
        "zhou-refl": "Answer: Let's work this out in a step by step way to be sure we have the right answer. Critique the initial answer, reconsider the other answer options and then give a single final answer."
    },
    "answer_extractions": {
        "kojima-01": "Therefore, the answer is",
        "kojima-02": "Therefore,",
        "kojima-03": "The answer is",
        "kojima-numerals": "Therefore, the answer (arabic numerals) is",
        "kojima-yes-no": "Therefore, the answer (Yes or No) is",
        "kojima-A-C": "Therefore, among A through C, the answer is",
        "kojima-A-D": "Therefore, among A through D, the answer is",
        "kojima-A-E": "Therefore, among A through E, the answer is",
        "kojima-A-F": "Therefore, among A through F, the answer is",
        "wei-01": "So the answer is"
    }
}